code-review/NRB_3471_3546/База_Было/InformationRegisters/РеестрКвалифицированныхИнвесторовПоЗакону.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РеестрКвалифицированныхИнвесторовПоЗакону</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФлагАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/РеестрКвалифицированныхИнвесторовПоЗакону/Ext/ManagerModule.bsl
Функция ЕстьКИПОЗакону(ЮрФизЛицо, Дата) Экспорт 
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрКвалифицированныхИнвесторовПоЗаконуСрезПоследних.ФлагАктивности КАК ФлагАктивности
		|ИЗ
		|	РегистрСведений.РеестрКвалифицированныхИнвесторовПоЗакону.СрезПоследних(&Дата, ЮрФизЛицо = &ЮрФизЛицо) КАК РеестрКвалифицированныхИнвесторовПоЗаконуСрезПоследних
		|ГДЕ
		|	РеестрКвалифицированныхИнвесторовПоЗаконуСрезПоследних.ФлагАктивности";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
